Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །ཕྱི་མའི་དུས་ལ་དེ་དག་དང་། །ཁྱོད་ནི་སྟོན་པར་མ་བྱེད་ཅིག །སྨྲ་བ་དང་ནི་གཏམ་གྱིས་ལ།
en: You should not in the future Be associated with them. {37} “Should you speak with them or converse, Treat them with respect;

source: །དེ་དག་ལ་ནི་རི་མོར་གྱིས།
en: Honor them without being disheartened,

source: །བྱང་ཆུབ་དམ་པའི་དོན་གྱི་ཕྱིར། །ཞུམ་པ་མེད་པར་བཀུར་སྟི་གྱིས།
en: In order to attain the highest enlightenment. {38}

source: །ལོ་གྲངས་དུ་ལོན་ཀུན་དྲིས་ལ།
en: “You should ask their age,

source: །དེ་དག་རྒན་པར་གྱུར་ན་ཡང་།
en: And if they are your senior

source: །དེ་ལ་རི་མོ་ལེགས་གྱིས་ལ།
en: Show them respect

source: །རྐང་པ་ལ་ཡང་མགོས་ཕྱག་འཚོལ།
en: And bow your head to their feet. {39} “Do not look at their errors,

source: །བྱང་ཆུབ་སྙིང་པོ་རྣམས་མཐོང་ན། །དེ་དག་འཁྲུལ་པ་མི་བལྟའོ།
en: But see the essence of enlightenment.

source: །དེ་ལ་ཁོང་ཁྲོ་མི་བསྐྱེད་ཅིང་།
en: Do not feel anger toward them

source: །རྟག་ཏུ་བྱམས་པའི་སེམས་སུ་བྱ།
en: But always have a loving mind. {40}

source: །གང་གི་འཁྲུལ་པ་ཅི་མཐོང་ཡང་།
en: “If you see an error of theirs

source: །དེ་དག་གི་ནི་ཉེས་མི་བརྗོད།
en: Do not mention that fault.

source: །ཅི་འདྲ་བ་ཡི་ལས་བྱས་པ།
en: Whatever karma they create

source: །འབྲས་བུ་དེ་འདྲ་ཐོབ་པར་འགྱུར།
en: The corresponding result will come to them. {41}

source: །བཞིན་གྱི་ཟླ་བ་འཛུམ་བཞིན་དུ།
en: “Have a smiling face that is like the moon

source: །རྒན་རབས་དང་ནི་གསར་བུ་ལ།
en: For both the seniors and the novices.

source: །རྟག་ཏུ་གསོང་པོར་སྨྲ་བ་དང་། །དེས་ཤིང་ང་རྒྱལ་བཅོམ་པར་བྱ།
en: You should always speak sincerely, Gently, and without pride. {42} “You should help them in adopting

source: །ཆོས་གོས་དང་ནི་བསོད་སྙོམས་ཀྱིས།
en: Dharma robes and receiving alms.

source: །དེ་དག་ལ་ནི་ཕན་གདགས་ཤིང་།
en: You should keep in your mind the thought,

source: །འདི་དག་ཐམས་ཅད་འདྲེན་འགྱུར་ཞེས།
en: ‘They are all going to become buddhas.’ {43}

source: །དེ་ལྟར་ཁྱོད་ཀྱི་སེམས་ཞོག་ཤིག །གལ་ཏེ་ཆོས་ཀྱི་སྦྱིན་པའི་ཕྱིར།
en: “If they request from you The gift of the Dharma,

source: །དེ་དག་ཁྱོད་ལ་གསོལ་འདེབས་ན། །དང་པོར་ཚིག་ནི་འདི་སྐད་སྨྲོས།
en: First you should say to them,

source: །ཁོ་བོས་མཚུངས་མེད་མ་བསླབས་སོ།
en: ‘I do not have much learning.’ {44}

source: །འདི་སྐད་དུ་ནི་ཚིག་བརྗོད་དེ།
en: “You should speak in this way:

source: །ཚེ་དང་ལྡན་པ་མཁས་ཤིང་རིག །བདག་ཉིད་ཆེན་པོའི་མདུན་དུ་ནི།
en: ‘Brother, wise scholar,

source: །བདག་གིས་ག་ལ་བཤད་ནུས་སྨྲོས།
en: How can I say anything In front of such a great being?’ {45}

source: །གྱ་ཚོམ་དུ་ནི་མ་སྨྲ་བར།
en: “Do not speak too hastily.

source: །དེ་དག་གི་ནི་སྣོད་རྟོགས་ལ།
en: Examine the one who would be the recipient.

source: །སྣོད་དུ་རུང་བར་རིག་ན་ནི།
en: If you know that he is a worthy recipient

source: །མ་གསོལ་བར་ཡང་བཤད་པར་གྱིས། །ཚུལ་ཁྲིམས་འཆལ་པ་འཁོར་ནང་ན།
en: Teach him even if he has not requested it. {46}

source: །མང་དུ་གནས་པར་མཐོང་ན་ཁྱོད།
en: “If you see that there are many present Among your followers who have bad conduct

source: །ཡོ་བྱད་བསྙུངས་པ་མ་ཆད་པར།
en: You should not teach them austerity,

source: །སྦྱིན་པ་ཡི་ནི་བསྔགས་པ་བརྗོད།
en: But instead you should praise generosity. {47} “If they have few desires

source: །ཚུལ་ཁྲིམས་གཙང་ལ་རབ་གནས་ཤིང་། །ཇི་སྟེ་འདོད་པ་ཉུང་ཡོད་ན།
en: And maintain pure conduct,

source: །བྱམས་པའི་སེམས་ནི་བསྐྱེད་ནས་སུ།
en: Have a loving mind

source: །ཡོ་བྱད་བསྙུངས་པའི་གཏམ་གྱིས་ཤིག །གལ་ཏེ་སྡིག་པ་འདོད་ཉུང་ཞིང་།
en: And speak to them of austerity. {48}

source: །ཚུལ་ཁྲིམས་ལྡན་པ་མང་ཡོད་ན།
en: “If there are many with correct conduct Who have restrained bad desires,

source: །དེ་ཚེ་ཕྱོགས་རྙེད་གྱུར་པའི་ཕྱིར།
en: When that aspect has been attained

source: །ཚུལ་ཁྲིམས་ཀྱི་ཡང་བསྔགས་པ་བརྗོད།
en: Then you should praise correct conduct. {49}

source: །ཐོག་མར་འཁོར་རྣམས་ཤེས་བྱ་སྟེ།
en: “First you should know your students,

source: །གལ་ཏེ་གཙང་ཡོད་དེ་ཡི་ཚེ།
en: And if they are known to be pure Then teach to them every one

source: །དགེ་བའི་ཆོས་རྣམས་ཇི་སྙེད་པ། །ཐམས་ཅད་དེར་ནི་རབ་ཏུ་བསྟན།
en: Of the virtuous qualities that there are. {50}

source: །སྦྱིན་དང་ཚུལ་ཁྲིམས་བཟོད་པ་དང་། །བརྩོན་འགྲུས་བསམ་གཏན་ཐོས་པ་དང་། །དེ་བཞིན་འདོད་ཉུང་ཡོ་བྱད་བསྙུངས། །རྟག་ཏུ་བསྔགས་ཤིང་བརྗོད་པར་བྱ།
en: “Always praise and teach Generosity, conduct, patience, Diligence, meditation, and learning, Contentment, few desires, and austerity. {51}

source: །དགོན་གནས་བསམ་གཏན་བསྟེན་པ་དང་། །འདུ་འཛིར་གནས་པ་སྤངས་པ་ནི།
en: “Living in solitary places, practicing meditation,

source: །དེ་དག་གཟུངས་ཀྱི་སྒོ་ཡིན་ཏེ།
en: And abandoning living among many people

source: །འདི་ཡི་བསྔགས་པ་བརྗོད་པར་བྱ།
en: Should be praised by you

source: །དགོན་པར་གནས་པ་མི་སྤོང་ཞིང་།
en: As the doorway to the power of retention. {52}

source: །ཚུལ་ཁྲིམས་ལ་ཡང་ལྷུར་མི་གཟུང་།
en: “They should have perfect conduct

source: །ནང་དུ་འཇོག་ལ་བསྟེན་བྱ་ཞིང་།
en: By staying in solitary places.

source: །སྦྱིན་པ་ལ་ནི་ལྷུར་མི་བྱ།
en: They should have perfect generosity Through remaining in seclusion. {53}

source: །ཚུལ་ཁྲིམས་ཕུང་པོར་གནས་ནས་ནི།
en: “Maintaining the aspect of conduct,

source: །མང་དུ་ཐོས་པ་བསྒྲུབ་པར་བྱ།
en: They should become very learned.

source: །ཏིང་འཛིན་འདི་ནི་ཡོངས་བཙལ་ཞིང་།
en: Those who seek for this samādhi

source: །སྟོན་པའི་རིང་བསྲེལ་མཆོད་པར་བྱ།
en: Should make offerings to the Buddha’s relics. {54}

source: །ཏིང་འཛིན་ཞི་བ་བཙལ་བའི་ཕྱིར།
en: “Those who seek this peaceful samādhi Should make offerings to the Buddha

source: །གདུགས་དང་རྒྱལ་མཚན་བ་དན་དང་། །སྤོས་དང་ཕྲེང་བ་བྱུག་པ་ཡིས།
en: With parasols, banners, and flags, And with incense, garlands, and ointments. {55} “Without being indolent or disheartened,

source: །སངས་རྒྱས་ལ་ནི་མཆོད་པ་བྱ། །དགའ་བར་འགྱུར་བའི་སིལ་སྙན་དང་། །གླུ་དབྱངས་སྦྱར་ཅིང་བླངས་ནས་སུ། །ཞུམ་པ་མེད་ཅིང་མི་གཡེལ་བར།
en: They should offer to the Buddha’s relics Delightful music,

source: །སངས་རྒྱས་ཀྱི་ནི་རིང་བསྲེལ་མཆོད།
en: United with song. {56}

source: །བྱང་ཆུབ་མཆོག་གི་དོན་གྱི་ཕྱིར།
en: “For the highest enlightenment They should offer to the Lord

source: །སྤོས་དང་ཕྲེང་བ་བདུག་པ་དང་། །གོས་དང་ཕྱེ་མ་ཇི་སྙེད་པ། །དེ་དག་ཀུན་གྱིས་མགོན་མཆོད་ཀྱིས།
en: As much incense, garlands, parasols, Clothing, and powders as there are. {57}

source: །ཏིང་འཛིན་ཞི་བ་འདི་ཚོལ་ཕྱིར། །མཆོད་པ་ཇི་སྙེད་ཅི་ཡོད་པ།
en: “For the sake of this peaceful samādhi,

source: །དཔག་མེད་བསམ་གྱིས་མི་ཁྱབ་པས།
en: All the immeasurable, inconceivable Offerings that there can be

source: །སངས་རྒྱས་ཀུན་ལ་མཆོད་པར་གྱིས། །བླ་མེད་སངས་རྒྱས་ཡེ་ཤེས་ཏེ། །ཆགས་མེད་ཡེ་ཤེས་རབ་ཚོལ་བས།
en: They should make to all the buddhas. {58} “Those who seek unimpeded wisdom, Who are without attachment, Give the highest wisdom of buddhahood,

source: །སེམས་ཅན་ཀུན་ལ་སྐལ་བའི་ཤས། །མི་གནས་པར་ནི་མཉམ་པར་སྦྱིན།
en: Equally shared for all beings. {59}

source: །མི་གནས་པར་ནི་གྱུར་ནས་སུ།
en: “I, too, having become unattached,

source: །ཏིང་འཛིན་ཞི་བ་ཚོལ་བའི་ཕྱིར། །སངས་རྒྱས་རྣམས་ལ་ངས་ཀྱང་སྔོན།
en: And seeking this peaceful samādhi,

source: །མཆོད་པ་བསམ་གྱིས་མི་ཁྱབ་བྱས།
en: Made inconceivable offerings To the buddhas of the past. {60}

source: །སངས་རྒྱས་སྐྱེ་བ་རྙེད་པར་དཀའ།
en: “It is difficult to attain the appearance of the buddhas.

source: །མིར་སྐྱེ་བ་ཡང་རྙེད་པར་དཀའ།
en: It is difficult to attain birth as a human.

source: །བསྟན་པ་ལ་ཡང་དད་པ་དང་། །རབ་བྱུང་བསྙེན་རྫོགས་རྙེད་པར་དཀའ།
en: It is difficult to attain faith in the teachings, And to become a mendicant. {61}

source: །གང་གིས་བྱང་ཆུབ་སེམས་བསྔོས་པ།
en: “One whose mind is dedicated to enlightenment

source: །དེ་དག་སྟོན་པ་མཉེས་པར་བྱས།
en: Is one who pleases the Buddha.

source: །དམ་བཅས་པ་ལས་མ་གཡོ་བར། །ཁྱོད་ནི་ནན་ཏན་གནས་པར་གྱིས།
en: Do not deviate from that commitment,

source: །ཟད་པའི་དུས་སུ་ཉེར་གནས་ཚེ།
en: But remain within that practice. {62}

source: །གང་གིས་མདོ་སྡེ་འདི་བཟུང་སྟེ།
en: “One who maintains this sūtra

source: །རབ་ཏུ་བརྗོད་པ་གཟུང་བྱས་ན། །མྱུར་དུ་སྤོབས་པ་ཐོབ་པར་འགྱུར།
en: During the time of destruction Should quickly gain eloquence And continue its teaching. {63} “For someone who has wished to hear it, There is an inconceivable accumulation of merit

source: །ཚིགས་བཅད་གཅིག་ཙམ་བཟུང་བ་ཡང་། །བསོད་ནམས་ཕུང་པོ་བསམ་ཡས་ན།
en: In possessing just one verse,

source: །ཉན་པར་འདོད་པས་མདོ་སྡེ་ཡང་། །ཐམས་ཅད་གཟུང་བ་ཅི་ཞིག་སྨོས།
en: Let alone obtaining the entire sūtra. {64}

source: །སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་ཐོབ།
en: “For even if as many beings as there are in a kalpa

source: །དེ་དག་མི་གཡེལ་མཆོད་བྱས་ཏེ།
en: Were diligently to make offerings

source: །བསྐལ་པ་སེམས་ཅན་སྙེད་དུ་ཡང་།
en: To all the beings who have attained enlightenment,

source: །རྟག་ཏུ་གུས་པར་མཆོད་པ་བས། །ཏིང་འཛིན་དམ་པ་འདི་ལས་ནི། །གང་གིས་ཚིགས་བཅད་གཅིག་བཟུང་བ།
en: And do so continuously with veneration, {65}

source: །བསོད་ནམས་སྔ་མ་ཐམས་ཅད་ནི། །བཅུ་དྲུག་ཆར་ཡང་མི་ཕོད་དོ།
en: “All the merit from the latter Will come not even to a sixteenth part Of the merit from possessing Just one verse of this samādhi. {66}

source: །ཏིང་འཛིན་འདི་ནི་ཐོས་ནས་སུ།
en: “One who hears this samādhi

source: །སུ་དག་ནེམ་ནུར་མི་བྱེད་པ།
en: Will be free of uncertainty.

source: །ཕན་ཡོན་བསམ་གྱིས་མི་ཁྱབ་སྟེ།
en: I know these inconceivable benefits

source: །སངས་རྒྱས་ཀྱི་ནི་མཁྱེན་པས་རིག །སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་འཇུག་པའི་ལེའུ་སྟེ་ཉི་ཤུ་ལྔ་པའོ།། །།
en: Through my wisdom of buddhahood.” {67} Conclusion of the twenty-fifth chapter, “Engaging in Discernment.”

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། །གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་འདི་འདོད་པ་དང་། །མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཐབས་མཁས་པར་བྱའོ།
en: Rejoicing Chapter 26 Then the Bhagavān said to the youth Candraprabha, “Therefore, young man, bodhisattva mahāsattvas who wish for this samādhi, and wish to attain quickly the highest, complete enlightenment of perfect buddhahood, should be skillful in methods.

source: །གཞོན་ནུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པ་ཡིན་ཞེ་ན།
en: “Young man, in what way should bodhisattva mahāsattvas be skillful in methods?

source: གཞོན་ནུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་ཐམས་ཅད་ལ་ཉེ་དུའི་སེམས་ཉེ་བར་བཞག་སྟེ།
en: For that, young man, bodhisattva mahāsattvas focus their minds upon all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་དང་། །བསོད་ནམས་ཀྱི་ཕུང་པོ་ཅི་ཡོད་པ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་རྗེས་སུ་ཡི་རང་བར་བྱས་ཏེ།
en: Those bodhisattva mahāsattvas rejoice in whatever roots of merit and accumulations of merit all beings have.

source: ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་དང་། བསོད་ནམས་ཀྱི་ཕུང་པོ་ལ་རྗེས་སུ་ཡི་རངས་ནས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དམིགས་པའི་སེམས་བསྐྱེད་པས་དགེ་བའི་རྩ་བ་དང་། བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་སེམས་ཅན་ཐམས་ཅད་ལ་གཏང་བར་བྱའོ།
en: Three times every day and three times every night they rejoice in whatever roots of merit and accumulations of merit all beings have, and the roots of merit and accumulation of merit that come from their taking omniscience as the focus of their aspiration they donate to all beings.

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཐབས་མཁས་པ་ལས་བྱུང་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པས་མྱུར་དུ་ཏིང་ངེ་འཛིན་འདི་འཐོབ་ཅིང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: “Young man, because those bodhisattva mahāsattva possess the accumulation of merit that comes from being skillful in methods, they will quickly attain this samādhi, and they will quickly attain the highest, complete enlightenment of perfect buddhahood.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །སེམས་ཅན་འདི་དག་ཐམས་ཅད་བདག་གི་གཉེན། །འདི་ཡི་བསོད་ནམས་མང་པོ་ཅི་ཡོད་པ།
en: Thereupon the Bhagavān spoke these verses:

source: །ཉིན་ཡང་ལན་གསུམ་མཚན་ཡང་ལན་གསུམ་དུ། །བྱང་ཆུབ་སེམས་བསྐྱེད་རྗེས་སུ་ཡི་རང་ངོ་།
en: “Three times a day and three times a night I develop the aspiration to enlightenment And rejoice in the entirety of the merit accumulated By all these beings who are my family. {1}

source: །སུ་དག་སྲོག་གི་ཕྱིར་ཡང་སྡིག་མི་བྱེད། །ཚུལ་ཁྲིམས་རྣམ་པར་དག་ལ་ཡི་རང་ངོ་།
en: “I rejoice in those who have pure conduct, Who will do nothing bad even to save their lives.

source: །བྱང་ཆུབ་སེམས་དཔའ་མོས་པ་ཕུན་སུམ་ཚོགས། །དེ་དག་བསོད་ནམས་ཅི་ཡོད་ཡི་རང་ངོ་།
en: I rejoice in whatever merit is possessed By bodhisattvas with perfect aspiration. {2}

source: །གང་དག་སངས་རྒྱས་དད་ཅིང་དེ་བཞིན་དུ།
en: “I rejoice in those who have faith in the Buddha,

source: །ཆོས་དང་དགེ་འདུན་དད་ལ་ཡི་རང་ངོ་།
en: Faith in the Dharma, and also the Saṅgha. I rejoice in those who make offerings to the Sugata

source: །བྱང་ཆུབ་ཉིད་ནི་རབ་ཏུ་འདོད་པའི་ཕྱིར།
en: Because of their desire for enlightenment. {3}

source: །བདེ་གཤེགས་མཆོད་པ་བྱེད་ལ་ཡི་རང་ངོ་།
en: “I rejoice in those who develop the aspiration

source: །རྫོགས་པའི་བྱང་ཆུབ་གདུང་ནི་གནས་བྱའི་ཕྱིར།
en: For the highest, supreme, unsurpassable enlightenment,

source: །སེམས་ཅན་དོན་དུ་བློ་གྲོས་ཆེན་པོ་ཡིས།
en: Doing so with great understanding, for the sake of beings,

source: །བླ་མེད་བྱང་ཆུབ་དམ་པ་མཆོག་ཏུ་ནི།
en: And so that the lineage of enlightenment will remain. {i}

source: །གང་གིས་སེམས་བསྐྱེད་དེ་ལ་ཡི་རང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེས་ནོན་པ་ཡིས།
en: “I rejoice in the bodhisattvas overwhelmed by compassion

source: །ནོར་དང་འབྲུ་དང་རིན་ཆེན་བཙུན་མོ་དང་། །སྲས་དང་སྲས་མོ་རྒྱལ་སྲིད་རྒྱས་པ་དང་། །བདག་གི་ཤ་ཡང་གཏོང་ལ་ཡི་རང་ངོ་།
en: Who give away their wealth, grain, and jewels, Their queens, sons, and daughters, Their vast kingdoms, and even their own flesh. {ii} “I rejoice in those who give away their own bodies With joyful minds for the sake of beings,

source: །ཤེས་རབ་ཡོངས་སུ་བསྒོམས་པས་ལུས་དུལ་ཞིང་། །ཐབས་ལ་མཁས་པའི་བསླབ་པ་རབ་བསླབས་པས།
en: Having trained in the training of skillful methods And subdued their bodies through meditation on wisdom. {iii}

source: །སེམས་ཅན་དོན་དུ་རབ་ཏུ་དགའ་སེམས་ཀྱིས། །བདག་གི་ལུས་ཀྱང་གཏོང་ལ་ཡི་རང་ངོ་། །གཅིག་པུ་གཉིས་སུ་མེད་པར་ནགས་གནས་ཤིང་།
en: “I rejoice in those who live in the forest,

source: །རྟག་ཏུ་བསེ་རུ་ལྟར་གྱུར་འཚོ་བ་གཙང་།
en: Always alone and solitary like a rhinoceros, Always with pure livelihood and few activities,

source: །ཁོར་མོར་བྱ་བ་ཉུང་ཞིང་སུ་དག་ནི།
en: Without acting hypocritically for the sake of reputation. {6}

source: །ཁེ་ཕྱིར་ཚུལ་འཆོས་མེད་ལ་ཡི་རང་ངོ་།
en: “I rejoice in those who have no entanglements,

source: །སུ་དག་སྟེན་པར་མི་བྱེད་ཕྲག་དོག་མེད། །ཁྱིམ་ལ་སྲེད་པར་མི་བྱེད་རྟག་པར་ཡང་།
en: Who have no envy or yearning for a home,

source: །ཁམས་གསུམ་དག་ལ་རབ་ཏུ་འཇིགས་སྐྲག་སྟེ།
en: Who are always terrified of the three realms

source: །འཇིག་རྟེན་མ་ཆགས་སྤྱོད་ལ་ཡི་རང་ངོ་།
en: And act without attachment to the world. {7}

source: །སྲིད་པར་སྐྱེ་བ་ཀུན་ལ་རབ་སྐྱོ་ཞིང་། །སུ་དག་སྤྲོས་པ་མེད་ལ་ཡི་རང་ངོ་།
en: “I rejoice in those who are without complication And are saddened by every rebirth into existence.

source: །རྩོད་པ་མེད་ཅིང་ཉེ་བར་ཞི་བའི་སེམས། །དེ་ལ་ཏིང་འཛིན་འདི་ནི་རྙེད་མི་དཀའ།
en: This samādhi will not be difficult to attain For those who do not dispute but have peaceful minds. {8}

source: །གང་གིས་འདུ་འཛི་ཉེས་པ་མཐོང་ནས་ནི།
en: “I rejoice in those who see the harmfulness of crowds,

source: །རྩོད་པ་ཐམས་ཅད་ཡོངས་སྤངས་དགོན་པར་གནས།
en: Who avoid every kind of disagreement,

source: །ཤིང་དྲུང་གནས་ཤིང་རྣམ་གྲོལ་ལྷུར་བྱེད་པ།
en: Who live in solitude, dwelling at the foot of trees,

source: །བདེ་གཤེགས་སྲས་ལ་རྗེས་སུ་ཡི་རང་ངོ་།
en: And who are heirs of the sugatas focused upon liberation. {9}

source: །བདག་ལ་མི་སྟོད་གཞན་ལ་མི་སྨོད་ཅིང་། །དགོན་པར་གནས་པ་དག་ལ་ཡི་རང་ངོ་། །སུ་དག་བསྟན་པ་འདི་ལ་བག་ཡོད་ཅིང་།
en: “I rejoice in those who live in solitude, Neither praising themselves nor criticizing others.

source: །བག་མེད་སྤངས་པ་དེ་ལ་ཡི་རང་ངོ་།
en: I rejoice in those who are not careless

source: །བྱང་ཆུབ་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཇི་སྙེད་པ།
en: But careful in the Buddha’s teaching. {10}

source: །ཀུན་གྱི་རྩ་བ་བག་ཡོད་འདི་ཡིན་ཏེ།
en: “That carefulness is the very root Of all the qualities of the aspects of enlightenment.

source: །སངས་རྒྱས་སྲས་གང་རྟག་ཏུ་བག་ཡོད་པ། །དེ་དག་ཏིང་འཛིན་འདི་ནི་རྙེད་མི་དཀའ།
en: This samādhi is not difficult to attain For any heirs of the Buddha who are always careful. {11}

source: །བདེ་བར་གཤེགས་པའི་བསྟན་པ་གཏེར་རྙེད་ཡིན།
en: “The teaching of the Sugata is a treasure that has been found.

source: །རབ་ཏུ་བྱུང་བ་གཏེར་ནི་གཉིས་པ་སྟེ།
en: Attaining homelessness is a second treasure.

source: །དད་པ་རྙེད་པ་གཏེར་ནི་གསུམ་པ་ཡིན།
en: The attainment of faith is a third treasure.

source: །ཏིང་འཛིན་འདི་ནི་གཏེར་རྙེད་བཞི་པའོ།
en: This samādhi is a fourth treasure. {12}

source: །སངས་རྒྱས་སྤྱོད་ཡུལ་སྟོང་པ་འདི་ཐོས་ནས།
en: “On learning of emptiness, of the field of activity of the buddhas,

source: །འདི་ལ་མི་སྤོང་བ་ཡང་གཏེར་རྙེད་ཡིན།
en: If it is not rejected, that is a treasure that has been found.

source: །སྤོབས་པ་མཐའ་ཡས་པ་ཡང་གཏེར་རྙེད་པ།
en: Endless eloquence is a treasure that has been found,

source: །གཟུངས་རྣམས་གང་ཡིན་དེ་དག་གཏེར་གྱི་མཆོག །དགེ་བའི་ཆོས་རྣམས་ཇི་སྙེད་རྗོད་པ་དག །ཚུལ་ཁྲིམས་ཐོས་གཏོང་བཟོད་པ་དེ་བཞིན་ཏེ། །ཐམས་ཅད་ཀྱི་ཡང་རྩ་བ་བག་ཡོད་འདི།
en: And any dhāraṇī is a supreme treasure. {13} “That carefulness is the very root Of all the virtuous qualities that have been proclaimed, And of correct conduct, learning, giving, and patience.

source: །གཏེར་རྙེད་ཡིན་པར་བདེ་བར་གཤེགས་པས་གསུངས།
en: The Sugata has taught that it is a treasure that has been found. {14}

source: །སངས་རྒྱས་བསྟན་པ་འདི་ལ་བག་ཡོད་ཅིང་།
en: “For those who are careful in the Buddha’s teaching,

source: །སུ་དག་ལ་ནི་ཡང་དག་སྨོན་ལམ་ཡོད།
en: For those who have perfect aspirations,

source: །དེ་དག་ཏིང་འཛིན་འདི་ནི་རྙེད་མི་དཀའ།
en: This samādhi will not be difficult to obtain.

source: །སངས་རྒྱས་བསྟན་པ་འདི་ལ་ཉེ་བར་གྱུར།
en: They are established in the Buddha’s teaching.” {15}

source: །རྗེས་སུ་ཡི་རང་བའི་ལེའུ་སྟེ་ཉི་ཤུ་དྲུག་པའོ།། །།
en: Conclusion of the twenty-sixth chapter, “Rejoicing.” The Benefits of Generosity Chapter 27

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བག་ཡོད་པར་བྱའོ་ཞེས་གཞོན་ནུ་ཁྱོད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ།
en: Then the Bhagavān said to the youth Candraprabha, “Young man, as it has been said, ‘Be careful,’ you, young man, should consequently train in that way.

source: གཞོན་ནུ་བག་ཡོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་རྙེད་པར་མི་དཀའ་ན་ཏིང་ངེ་འཛིན་འདི་ལྟ་ཅི་སྨོས།
en: Because, young man, for bodhisattva mahāsattvas who are careful, the highest, complete enlightenment is not difficult to attain, let alone this samādhi.

source: གཞོན་ནུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བག་ཡོད་པ་ཡིན་ཞེ་ན།
en: “Young man, in what way should bodhisattva mahāsattvas be careful?

source: གཞོན་ནུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་ཡིན་ནོ།
en: For that, young man, bodhisattva mahāsattvas should have perfectly pure conduct.

source: །གཞོན་ནུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་ཡིན་ཞེ་ན།
en: Young man, in what way should bodhisattva mahāsattvas have perfectly pure conduct?

source: གཞོན་ནུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་ནི་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དང་མ་བྲལ་བས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་ཡིན་ཏེ།
en: For that, young man, bodhisattva mahāsattvas who have perfectly pure conduct, never separating from an all-knowing mind, should practice the six perfections.

source: དེའི་ཕན་ཡོན་འདི་དག་ཉོན་ཅིག་དང་ངས་ཁྱོད་ལ་བཤད་དོ།
en: Listen, for I shall teach you their benefits.

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ལ་མོས་པའི་ཕན་ཡོན་ནི་བཅུ་སྟེ།
en: “Young man, there are ten benefits for bodhisattva mahāsattvas who aspire to generosity.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the ten benefits? They are: [1]

source: དེའི་སེར་སྣའི་ཉོན་མོངས་པ་ཚར་བཅད་པ་ཡིན།
en: the kleśa of avarice is overcome; [2]

source: དེའི་སེམས་རྟག་ཏུ་གཏོང་བའི་རྗེས་སུ་སྤེལ་བ་ཡིན།
en: their minds are constantly devoted to generosity; [3]

source: སྐྱེ་བོ་མང་པོ་དང་ཐུན་མོང་པའི་ལོངས་སྤྱོད་ལས་སྙིང་པོ་ལེན་པ་ཡིན།
en: from the ordinary wealth of the populace they obtain what is essential; [4]

source: ལོངས་སྤྱོད་ཆེན་པོའི་རིགས་སུ་སྐྱེ་ཞིང་སྐྱེས་མ་ཐག་ཏུ་དེ་གཏོང་བའི་སེམས་མངོན་དུ་འགྱུར་བ་ཡིན། འཁོར་བཞི་རྣམས་ལ་ཕངས་ཤིང་སྡུག་པ་ཡིན།
en: they are reborn into a wealthy family, and as soon as they are born they have a mind that aspires to generosity; [5] they are beloved by the fourfold assembly; [6]

source: །འཇིགས་པ་མེད་ཅིང་ཞུམ་པ་མེད་པར་འཁོར་གྱི་ནང་དུ་འགྲོ།
en: they enter the assembly without fear or lack of confidence; [7]

source: ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་དེའི་རྒྱ་ཆེར་བརྗོད་པའི་སྒྲ་ཚིགས་སུ་བཅད་པ་མངོན་པར་འབྱུང་།
en: verses that praise their greatness spread to the cardinal and intermediate directions; [8]

source: རྐང་ལག་འཇམ་ཞིང་གཞོན་པ་ཡིན།
en: they have soft and youthful arms and legs; [9]

source: རྐང་མཐིལ་མཉམ་ཞིང་རབ་ཏུ་གནས་པ་ཡིན། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་གི་བར་དུ་དགེ་བའི་བཤེས་གཉེན་དང་མི་འབྲལ་བ་ཡིན་ཏེ།
en: they stand on feet with level soles; and [10] they are never apart from kalyāṇamitras until they are seated at the Bodhimaṇḍa.

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ལ་མོས་པའི་ལེགས་པ་ནི་འདི་བཅུའོ།
en: “Young man, those are the ten benefits for the bodhisattva mahāsattvas who aspire to generosity.”

source: དེས་ནི་སེར་སྣ་ཚར་བཅད་ཅིང་།
en: “Avarice is overcome.

source: །གཏོང་བའི་སེམས་ཀྱང་རྣམ་པར་སྤེལ།
en: Their generosity increases.

source: །སྙིང་པོ་དག་ནི་བླངས་པར་འགྱུར།
en: They are those who obtain the essentials

source: །ཤིན་ཏུ་འབྱོར་པའི་རིགས་སུ་སྐྱེ། །སྐྱེས་མ་ཐག་ཏུ་དེ་ཡི་སེམས།
en: And are reborn into a wealthy family. {1} “As soon as they are born There is generosity in their minds. They are beloved by beings,

source: །གཏོང་བ་དག་ལ་ཤིན་ཏུ་འཇུག །རབ་ཏུ་བྱུང་དང་ཁྱིམ་པ་ཡི།
en: Both the laity and mendicants. {2}

source: །སེམས་ཅན་རྣམས་ལ་ཕངས་པར་འགྱུར།
en: “They enter the assembly

source: །འཇིགས་པ་མེད་ཅིང་འཁོར་དུ་ཡང་།
en: Fearlessly and confidently.

source: །མ་ཞུམ་པར་ནི་ཉེ་བར་འགྲོ།
en: Their renown spreads

source: །གྲོང་དང་གྲོང་ཁྱེར་རྣམས་སུ་ཡང་། །དེ་ཡི་སྒྲ་ནི་རྒྱ་ཆེར་འགྱུར།
en: Through the villages and towns. {3}

source: །རྐང་ལག་དག་ནི་འཇམ་པ་ཡང་།
en: “They have soft arms and legs

source: །རྙེད་དཀའ་བར་ནི་ཡོང་མི་འགྱུར།
en: That they gain without difficulty.

source: །སངས་རྒྱས་དང་ནི་ཉན་ཐོས་དང་། །དགེ་བའི་བཤེས་གཉེན་ཐོབ་པར་འགྱུར།
en: They obtain kalyāṇamitras, Both buddhas and śrāvakas. {4}

source: །སེར་སྣའི་སེམས་ནི་ནམ་ཡང་མི་འབྱུང་སྟེ།
en: “They never have an avaricious mind;

source: །དེ་ཡི་སེམས་ནི་རྟག་ཏུ་གཏོང་ལ་དགའ།
en: Their minds always delight in generosity.

source: །སེམས་ཅན་བྱེ་བ་མང་ལ་ཕངས་པར་འགྱུར།
en: They are beloved by millions of beings.

source: །སེར་སྣ་མེད་པའི་ཕན་ཡོན་འདི་དག་ཡིན།
en: Those are the benefits of being without avarice. {5}

source: །དེ་ནི་ནོར་མང་རིགས་སུ་སྐྱེ་བར་འགྱུར།
en: “They are reborn into a family with great wealth.

source: །སྐྱེས་ནས་དེ་ཡི་ཡིད་ནི་གཏོང་ལ་དགའ།
en: At birth they have minds that delight in generosity.

source: །སྙིང་པོ་བླངས་ནས་འཆི་བའི་དུས་བྱེད་འགྱུར།
en: They obtain the essentials and choose the time of passing away.

source: །འཇིགས་པ་མེད་པར་འཁོར་གྱི་ནང་དུ་འགྲོ།
en: “Fearlessly they enter an assembly.

source: །ཕྱོགས་སུ་རྒྱ་ཆེར་དེ་ཡི་སྒྲ་ཡང་གྲགས།
en: Their renown spreads in all directions.

source: །དེ་ཡི་རྐང་ལག་རྟག་ཏུ་འཇམ་པར་འགྱུར།
en: They always have soft arms and legs.

source: །དགེ་བའི་བཤེས་གཉེན་རྙེད་པར་མི་དཀའ་སྟེ།
en: “It is not difficult for them to obtain kalyāṇamitras.

source: །དེས་ནི་སངས་རྒྱས་རྣམས་དང་ཉན་ཐོས་མཐོང་།
en: They also see buddhas and śrāvakas.

source: །མཐོང་ནས་དེ་དག་དད་པས་མཆོད་པ་བྱེད།
en: Seeing them, they make offerings to them with faith.

source: །སྦྱིན་པའི་ཕན་ཡོན་གྱི་ལེའུ་སྟེ་ཉི་ཤུ་བདུན་པའོ།། །།
en: Conclusion of the twenty-seventh chapter, “The Benefits of Generosity.” The Teaching on Correct Conduct Chapter 28

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པའི་ཕན་ཡོན་འདི་བཅུ་སྟེ།
en: “Young man, there are ten benefits for bodhisattva mahāsattvas from perfectly pure, correct conduct.
